# CODE 7-12
## PIVOT TABLE

In [2]:
import seaborn as sns

df = sns.load_dataset("tips")

df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
p1 = df.pivot_table(index = 'sex', columns = 'day', values = 'total_bill', aggfunc = 'mean', observed = True)
p1.head()

day          Thur        Fri        Sat        Sun
sex
Male    18.714667  19.857000  20.802542  21.887241
Female  16.715312  14.145556  19.680357  19.872222

In [10]:
p2 = df.pivot_table(index = 'sex', columns = 'time', values = 'total_bill', aggfunc = 'mean', observed = True)
p2.head()

time        Lunch     Dinner
sex
Male    18.048485  21.461452
Female  16.339143  19.213077

In [11]:
p3 = df.pivot_table(index = 'time', columns = 'day', values = 'tip', aggfunc = 'max', observed = True)
p3.head()

day     Thur   Fri   Sat  Sun
time
Lunch    6.7  3.48   NaN  NaN
Dinner   3.0  4.73  10.0  6.5